*** DONE [[https://github.com/kaiwk/leetcode.el][leetcode.el]]
    :LOGBOOK:
    CLOCK: [2020-03-03 Tue 11:21]--[2020-03-03 Tue 11:59] =>  0:38
    CLOCK: [2020-02-06 Thu 13:57]--[2020-02-06 Thu 13:57] =>  0:00
    :END:
  [2020-02-06 Thu 13:57]
** DONE spacemacs configuration into org-mode
   CLOSED: [2020-07-02 Thu 18:51]
   :PROPERTIES:
   :ID:       2A4C0938-EACC-49E8-9194-FC3C1A9DE441
   :END:
   :LOGBOOK:
   CLOCK: [2020-03-05 Thu 10:51]--[2020-03-05 Thu 10:51] =>  0:00
   :END:
 [2020-03-05 Thu 10:51]

 [[~/Documents/Garage/orgible/spacemacs-babel.org][babel file]]

 =C-c C-v t= to output the configuration to .spacemacs.  (org-babel-tangle)

*** tags jump
 1. include head file in the project

 create .clang_complete file in the project root directory. in .clang_complete, each line has a clang++ include flag, for instance: -I./lib

 a shell script to generate .clang_complete
 #+begin_src shell
 dir=~/Documents/Ice/ice-detector
 find ${dir} -name "*.h" -print | xargs -n 1 dirname | sort | uniq | awk '{print "-I"$0}' > ${dir}/.clang_complete
 cat ${dir}/.clang_complete
 #+end_src

 #+RESULTS:
 | -I/Users/xin/Documents/Ice/ice-detector/CORE                 |
 | -I/Users/xin/Documents/Ice/ice-detector/GD32/CMSIS           |
 | -I/Users/xin/Documents/Ice/ice-detector/GD32/Library/Include |
 | -I/Users/xin/Documents/Ice/ice-detector/GD32/User            |
 | -I/Users/xin/Documents/Ice/ice-detector/GD32/driver          |
 | -I/Users/xin/Documents/Ice/ice-detector/HARDWARE/fiber       |
 | -I/Users/xin/Documents/Ice/ice-detector/STM32F10x_FWLib/inc  |
 | -I/Users/xin/Documents/Ice/ice-detector/SYSTEM               |
 | -I/Users/xin/Documents/Ice/ice-detector/USER                 |

 a more easy to generate .clang_complete file is using [[https://github.com/xavierd/clang_complete/blob/master/bin/cc_args.py][cc_args.py]]

 if configurations takes effect, the argument 'clang-complete-arguments' should show all the include path.
 if not, refer to https://www.youtube.com/watch?v=OjbkCEkboA8 at 30min, set (syntax-checking :variables syntax-checking-enable-by-default nil)


 2. go to definition

 =gd=

 the better practice is go the definition in a new-opened window by =C-w gd=

 3. jump to head file

 - SPC m g a:	open matching file (e.g. switch between .cpp and .h)
 - SPC m g A:	open matching file in another window (e.g. switch between .cpp and .h
***** demo
   #+name: gtest_demo
   #+begin_src C++ :includes <gtest/gtest.h> <iostream> :flags -std=c++11 -lgtest -lpthread :results verbatim
     int add(int a, int b){
          return a + b;
     }

     int sub(int a, int b){
          return a - b;
     }

     // case1
     TEST(testcase, c1){
          EXPECT_EQ(3, add(1, 2));
          ASSERT_EQ(12, add(2, 6));
     }

     // case2
     TEST(test, c2){
          EXPECT_EQ(-1, sub(1, 2));
     }

     int main(int argc, char ** argv) {
          testing::InitGoogleTest(&argc, argv);
          int flag = RUN_ALL_TESTS();
          // the result of RUN_ALL_TESTS() is 0 is all test cases success. otherwise, it is 1
          // according to experience in org mode, gtest main function output nothing when return 1 or return RUN_ALL_TESTS() if any failed test cases
          // return 0 can always output the test case messages.

          // return flag
          return 0;
     }
   #+end_src

   #+RESULTS: gtest_demo
   #+begin_example
   [==========] Running 2 tests from 2 test suites.
   [----------] Global test environment set-up.
   [----------] 1 test from testcase
   [ RUN      ] testcase.c1
   /var/folders/kx/y4dl93m51t7c2f3mq5q8npx00000gp/T/babel-20S745/C-src-53yRWv.cpp:20: Failure
   Expected equality of these values:
     12
     add(2, 6)
       Which is: 8
   [  FAILED  ] testcase.c1 (0 ms)
   [----------] 1 test from testcase (0 ms total)

   [----------] 1 test from test
   [ RUN      ] test.c2
   [       OK ] test.c2 (0 ms)
   [----------] 1 test from test (0 ms total)

   [----------] Global test environment tear-down
   [==========] 2 tests from 2 test suites ran. (0 ms total)
   [  PASSED  ] 1 test.
   [  FAILED  ] 1 test, listed below:
   [  FAILED  ] testcase.c1

    1 FAILED TEST
   #+end_example

**** clock in
     :LOGBOOK:
     CLOCK: [2020-07-02 Thu 17:38]--[2020-07-02 Thu 17:39] =>  0:01
     :END:
 (global-set-key (kbd "<f9> SPC") 'bh/clock-in-last-task)
**** DONE block agenda
     CLOSED: [2020-07-02 Thu 18:51]
     :LOGBOOK:
     CLOCK: [2020-07-02 Thu 17:43]--[2020-07-02 Thu 17:44] =>  0:01
     :END:
 Tasks to refile are in their own section of the block agenda. To find tasks to refile I run my agenda view with F12 SPC and scroll down to second section of the block agenda: Tasks to Refile. This view shows all tasks (even ones marked in a done state).

 Bulk refiling in the agenda works very well for multiple tasks going to the same place. Just mark the tasks with m and then B r to refile all of them to a new location. Occasionally I'll also refile tasks as subtasks of the current clocking task using C-2 C-c C-w from the refile.org file.

 Refiling all of my tasks tends to take less than a minute so I normally do this a couple of times a day.
*** org mode video [[https://www.youtube.com/watch?v=PVsSOmUB7ic][Learn Emacs Org Mode: Spacemacs Intro Tutorial - YouTube]]
    :LOGBOOK:
    CLOCK: [2020-03-02 Mon 17:48]--[2020-03-02 Mon 17:52] =>  0:04
    CLOCK: [2020-03-02 Mon 17:36]--[2020-03-02 Mon 17:47] =>  0:11
    :END:
  [2020-03-02 Mon 17:36]

** DONE org-brain learn to use
   :LOGBOOK:
   CLOCK: [2020-02-14 Fri 10:01]--[2020-02-14 Fri 10:02] =>  0:01
   :END:
